Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_ACCEN10_Bits.EN5 */
#define IFX_SCU_ACCEN10_EN5_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ACCEN10_Bits.EN5 */
#define IFX_SCU_ACCEN10_EN5_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN10_Bits.EN5 */
#define IFX_SCU_ACCEN10_EN5_OFF                 (5)

/** \\brief  Length for Ifx_SCU_ACCEN10_Bits.EN6 */
#define IFX_SCU_ACCEN10_EN6_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ACCEN10_Bits.EN6 */
#define IFX_SCU_ACCEN10_EN6_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN10_Bits.EN6 */
#define IFX_SCU_ACCEN10_EN6_OFF                 (6)

/** \\brief  Length for Ifx_SCU_ACCEN10_Bits.EN7 */
#define IFX_SCU_ACCEN10_EN7_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ACCEN10_Bits.EN7 */
#define IFX_SCU_ACCEN10_EN7_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN10_Bits.EN7 */
#define IFX_SCU_ACCEN10_EN7_OFF                 (7)

/** \\brief  Length for Ifx_SCU_ACCEN10_Bits.EN8 */
#define IFX_SCU_ACCEN10_EN8_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ACCEN10_Bits.EN8 */
#define IFX_SCU_ACCEN10_EN8_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN10_Bits.EN8 */
#define IFX_SCU_ACCEN10_EN8_OFF                 (8)

/** \\brief  Length for Ifx_SCU_ACCEN10_Bits.EN9 */
#define IFX_SCU_ACCEN10_EN9_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ACCEN10_Bits.EN9 */
#define IFX_SCU_ACCEN10_EN9_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN10_Bits.EN9 */
#define IFX_SCU_ACCEN10_EN9_OFF                 (9)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_OFF             (0)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_OFF             (1)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_OFF             (2)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_OFF             (3)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_OFF             (4)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_OFF             (5)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.BBBDIV */
#define IFX_SCU_CCUCON0_BBBDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.BBBDIV */
#define IFX_SCU_CCUCON0_BBBDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.BBBDIV */
#define IFX_SCU_CCUCON0_BBBDIV_OFF              (20)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_LEN              (2)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_MSK              (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_OFF              (28)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_LEN             (2)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_MSK             (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_OFF             (26)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_LEN              (2)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_MSK              (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_OFF              (24)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.GTMDIV */
#define IFX_SCU_CCUCON0_GTMDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.GTMDIV */
#define IFX_SCU_CCUCON0_GTMDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.GTMDIV */
#define IFX_SCU_CCUCON0_GTMDIV_OFF              (4)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_OFF                 (31)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.LPDIV */
#define IFX_SCU_CCUCON0_LPDIV_LEN               (3)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.LPDIV */
#define IFX_SCU_CCUCON0_LPDIV_MSK               (0x7)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.LPDIV */
#define IFX_SCU_CCUCON0_LPDIV_OFF               (12)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_OFF              (16)

