Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_OFF              (8)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.STMDIV */
#define IFX_SCU_CCUCON0_STMDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.STMDIV */
#define IFX_SCU_CCUCON0_STMDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.STMDIV */
#define IFX_SCU_CCUCON0_STMDIV_OFF              (0)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_OFF                  (30)

/** \\brief  Length for Ifx_SCU_CCUCON10_Bits.CPU4DIV */
#define IFX_SCU_CCUCON10_CPU4DIV_LEN            (6)

/** \\brief  Mask for Ifx_SCU_CCUCON10_Bits.CPU4DIV */
#define IFX_SCU_CCUCON10_CPU4DIV_MSK            (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON10_Bits.CPU4DIV */
#define IFX_SCU_CCUCON10_CPU4DIV_OFF            (0)

/** \\brief  Length for Ifx_SCU_CCUCON11_Bits.CPU5DIV */
#define IFX_SCU_CCUCON11_CPU5DIV_LEN            (6)

/** \\brief  Mask for Ifx_SCU_CCUCON11_Bits.CPU5DIV */
#define IFX_SCU_CCUCON11_CPU5DIV_MSK            (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON11_Bits.CPU5DIV */
#define IFX_SCU_CCUCON11_CPU5DIV_OFF            (0)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.CLKSELMCAN */
#define IFX_SCU_CCUCON1_CLKSELMCAN_LEN          (2)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.CLKSELMCAN */
#define IFX_SCU_CCUCON1_CLKSELMCAN_MSK          (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.CLKSELMCAN */
#define IFX_SCU_CCUCON1_CLKSELMCAN_OFF          (4)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.CLKSELMSC */
#define IFX_SCU_CCUCON1_CLKSELMSC_LEN           (2)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.CLKSELMSC */
#define IFX_SCU_CCUCON1_CLKSELMSC_MSK           (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.CLKSELMSC */
#define IFX_SCU_CCUCON1_CLKSELMSC_OFF           (20)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.CLKSELQSPI */
#define IFX_SCU_CCUCON1_CLKSELQSPI_LEN          (2)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.CLKSELQSPI */
#define IFX_SCU_CCUCON1_CLKSELQSPI_MSK          (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.CLKSELQSPI */
#define IFX_SCU_CCUCON1_CLKSELQSPI_OFF          (28)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_OFF                 (31)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.MCANDIV */
#define IFX_SCU_CCUCON1_MCANDIV_LEN             (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.MCANDIV */
#define IFX_SCU_CCUCON1_MCANDIV_MSK             (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.MCANDIV */
#define IFX_SCU_CCUCON1_MCANDIV_OFF             (0)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.MSCDIV */
#define IFX_SCU_CCUCON1_MSCDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.MSCDIV */
#define IFX_SCU_CCUCON1_MSCDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.MSCDIV */
#define IFX_SCU_CCUCON1_MSCDIV_OFF              (16)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.PLL1DIVDIS */
#define IFX_SCU_CCUCON1_PLL1DIVDIS_LEN          (1)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.PLL1DIVDIS */
#define IFX_SCU_CCUCON1_PLL1DIVDIS_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.PLL1DIVDIS */
#define IFX_SCU_CCUCON1_PLL1DIVDIS_OFF          (7)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.QSPIDIV */
#define IFX_SCU_CCUCON1_QSPIDIV_LEN             (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.QSPIDIV */
#define IFX_SCU_CCUCON1_QSPIDIV_MSK             (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.QSPIDIV */
#define IFX_SCU_CCUCON1_QSPIDIV_OFF             (24)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON2_ASCLINFDIV_LEN          (4)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON2_ASCLINFDIV_MSK          (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON2_ASCLINFDIV_OFF          (0)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON2_ASCLINSDIV_LEN          (4)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON2_ASCLINSDIV_MSK          (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON2_ASCLINSDIV_OFF          (8)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.CLKSELASCLINS */
#define IFX_SCU_CCUCON2_CLKSELASCLINS_LEN       (2)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.CLKSELASCLINS */
#define IFX_SCU_CCUCON2_CLKSELASCLINS_MSK       (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.CLKSELASCLINS */
#define IFX_SCU_CCUCON2_CLKSELASCLINS_OFF       (12)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_OFF                 (31)


/** \\brief  Length for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_LEN             (6)

/** \\brief  Mask for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_MSK             (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_OFF             (0)

/** \\brief  Length for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_LEN             (6)

/** \\brief  Mask for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_MSK             (0x3f)

