Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_OFF             (0)

/** \\brief  Length for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_LEN             (6)

/** \\brief  Mask for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_MSK             (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_OFF             (0)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.CPU3DIV */
#define IFX_SCU_CCUCON9_CPU3DIV_LEN             (6)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.CPU3DIV */
#define IFX_SCU_CCUCON9_CPU3DIV_MSK             (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.CPU3DIV */
#define IFX_SCU_CCUCON9_CPU3DIV_OFF             (0)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_LEN                 (4)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_MSK                 (0xf)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_OFF                 (12)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHPK */
#define IFX_SCU_CHIPID_CHPK_LEN                 (4)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHPK */
#define IFX_SCU_CHIPID_CHPK_MSK                 (0xf)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHPK */
#define IFX_SCU_CHIPID_CHPK_OFF                 (8)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_LEN                (6)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_MSK                (0x3f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_OFF                (0)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_LEN                (2)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_MSK                (0x3)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_OFF                (6)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_OFF                  (16)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_LEN                (4)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_MSK                (0xf)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_OFF                (24)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_OFF                  (31)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_LEN                (7)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_MSK                (0x7f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_OFF                (17)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.VART */
#define IFX_SCU_CHIPID_VART_LEN                 (3)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.VART */
#define IFX_SCU_CHIPID_VART_MSK                 (0x7)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.VART */
#define IFX_SCU_CHIPID_VART_OFF                 (28)

/** \\brief  Length for Ifx_SCU_EICON0_Bits.ENDINIT */
#define IFX_SCU_EICON0_ENDINIT_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EICON0_Bits.ENDINIT */
#define IFX_SCU_EICON0_ENDINIT_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EICON0_Bits.ENDINIT */
#define IFX_SCU_EICON0_ENDINIT_OFF              (1)

/** \\brief  Length for Ifx_SCU_EICON0_Bits.EPW */
#define IFX_SCU_EICON0_EPW_LEN                  (14)

/** \\brief  Mask for Ifx_SCU_EICON0_Bits.EPW */
#define IFX_SCU_EICON0_EPW_MSK                  (0x3fff)

/** \\brief  Offset for Ifx_SCU_EICON0_Bits.EPW */
#define IFX_SCU_EICON0_EPW_OFF                  (2)

/** \\brief  Length for Ifx_SCU_EICON0_Bits.REL */
#define IFX_SCU_EICON0_REL_LEN                  (16)

/** \\brief  Mask for Ifx_SCU_EICON0_Bits.REL */
#define IFX_SCU_EICON0_REL_MSK                  (0xffff)

/** \\brief  Offset for Ifx_SCU_EICON0_Bits.REL */
#define IFX_SCU_EICON0_REL_OFF                  (16)

/** \\brief  Length for Ifx_SCU_EICON0_Bits.Reserved */
#define IFX_SCU_EICON0_RESERVED_LEN             (1)

/** \\brief  Mask for Ifx_SCU_EICON0_Bits.Reserved */
#define IFX_SCU_EICON0_RESERVED_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_EICON0_Bits.Reserved */
#define IFX_SCU_EICON0_RESERVED_OFF             (0)

/** \\brief  Length for Ifx_SCU_EICON1_Bits.DR */
#define IFX_SCU_EICON1_DR_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EICON1_Bits.DR */
#define IFX_SCU_EICON1_DR_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EICON1_Bits.DR */
#define IFX_SCU_EICON1_DR_OFF                   (3)

/** \\brief  Length for Ifx_SCU_EICON1_Bits.IR0 */
#define IFX_SCU_EICON1_IR0_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICON1_Bits.IR0 */
#define IFX_SCU_EICON1_IR0_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EICON1_Bits.IR0 */
#define IFX_SCU_EICON1_IR0_OFF                  (2)

/** \\brief  Length for Ifx_SCU_EICON1_Bits.IR1 */
#define IFX_SCU_EICON1_IR1_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICON1_Bits.IR1 */
#define IFX_SCU_EICON1_IR1_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EICON1_Bits.IR1 */
#define IFX_SCU_EICON1_IR1_OFF                  (5)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_OFF                  (11)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_MSK                  (0x1)

