Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_OFF                  (27)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_LEN                  (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_MSK                  (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_OFF                  (4)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_LEN                  (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_MSK                  (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_OFF                  (20)

/** \\brief  Length for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_OFF                   (8)

/** \\brief  Length for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_OFF                   (24)

/** \\brief  Length for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_LEN                   (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_MSK                   (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_OFF                   (12)

/** \\brief  Length for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_LEN                   (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_MSK                   (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_OFF                   (28)

/** \\brief  Length for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_OFF                  (10)

/** \\brief  Length for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_OFF                  (26)

/** \\brief  Length for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_OFF                   (9)

/** \\brief  Length for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_OFF                   (25)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.DEPTH */
#define IFX_SCU_EIFILT_DEPTH_LEN                (4)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.DEPTH */
#define IFX_SCU_EIFILT_DEPTH_MSK                (0xf)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.DEPTH */
#define IFX_SCU_EIFILT_DEPTH_OFF                (28)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ0A */
#define IFX_SCU_EIFILT_FILRQ0A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ0A */
#define IFX_SCU_EIFILT_FILRQ0A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ0A */
#define IFX_SCU_EIFILT_FILRQ0A_OFF              (0)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ0C */
#define IFX_SCU_EIFILT_FILRQ0C_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ0C */
#define IFX_SCU_EIFILT_FILRQ0C_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ0C */
#define IFX_SCU_EIFILT_FILRQ0C_OFF              (4)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ1A */
#define IFX_SCU_EIFILT_FILRQ1A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ1A */
#define IFX_SCU_EIFILT_FILRQ1A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ1A */
#define IFX_SCU_EIFILT_FILRQ1A_OFF              (10)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ1C */
#define IFX_SCU_EIFILT_FILRQ1C_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ1C */
#define IFX_SCU_EIFILT_FILRQ1C_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ1C */
#define IFX_SCU_EIFILT_FILRQ1C_OFF              (5)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ2A */
#define IFX_SCU_EIFILT_FILRQ2A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ2A */
#define IFX_SCU_EIFILT_FILRQ2A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ2A */
#define IFX_SCU_EIFILT_FILRQ2A_OFF              (2)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ2B */
#define IFX_SCU_EIFILT_FILRQ2B_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ2B */
#define IFX_SCU_EIFILT_FILRQ2B_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ2B */
#define IFX_SCU_EIFILT_FILRQ2B_OFF              (14)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ2C */
#define IFX_SCU_EIFILT_FILRQ2C_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ2C */
#define IFX_SCU_EIFILT_FILRQ2C_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ2C */
#define IFX_SCU_EIFILT_FILRQ2C_OFF              (7)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ3A */
#define IFX_SCU_EIFILT_FILRQ3A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ3A */
#define IFX_SCU_EIFILT_FILRQ3A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ3A */
#define IFX_SCU_EIFILT_FILRQ3A_OFF              (3)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ3B */
#define IFX_SCU_EIFILT_FILRQ3B_LEN              (1)

