Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ3B */
#define IFX_SCU_EIFILT_FILRQ3B_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ3B */
#define IFX_SCU_EIFILT_FILRQ3B_OFF              (15)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ3C */
#define IFX_SCU_EIFILT_FILRQ3C_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ3C */
#define IFX_SCU_EIFILT_FILRQ3C_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ3C */
#define IFX_SCU_EIFILT_FILRQ3C_OFF              (6)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ4A */
#define IFX_SCU_EIFILT_FILRQ4A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ4A */
#define IFX_SCU_EIFILT_FILRQ4A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ4A */
#define IFX_SCU_EIFILT_FILRQ4A_OFF              (8)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ4D */
#define IFX_SCU_EIFILT_FILRQ4D_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ4D */
#define IFX_SCU_EIFILT_FILRQ4D_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ4D */
#define IFX_SCU_EIFILT_FILRQ4D_OFF              (13)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ5A */
#define IFX_SCU_EIFILT_FILRQ5A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ5A */
#define IFX_SCU_EIFILT_FILRQ5A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ5A */
#define IFX_SCU_EIFILT_FILRQ5A_OFF              (1)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ6A */
#define IFX_SCU_EIFILT_FILRQ6A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ6A */
#define IFX_SCU_EIFILT_FILRQ6A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ6A */
#define IFX_SCU_EIFILT_FILRQ6A_OFF              (9)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ6D */
#define IFX_SCU_EIFILT_FILRQ6D_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ6D */
#define IFX_SCU_EIFILT_FILRQ6D_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ6D */
#define IFX_SCU_EIFILT_FILRQ6D_OFF              (12)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ7A */
#define IFX_SCU_EIFILT_FILRQ7A_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ7A */
#define IFX_SCU_EIFILT_FILRQ7A_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ7A */
#define IFX_SCU_EIFILT_FILRQ7A_OFF              (11)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILRQ7C */
#define IFX_SCU_EIFILT_FILRQ7C_LEN              (1)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILRQ7C */
#define IFX_SCU_EIFILT_FILRQ7C_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILRQ7C */
#define IFX_SCU_EIFILT_FILRQ7C_OFF              (16)

/** \\brief  Length for Ifx_SCU_EIFILT_Bits.FILTDIV */
#define IFX_SCU_EIFILT_FILTDIV_LEN              (4)

/** \\brief  Mask for Ifx_SCU_EIFILT_Bits.FILTDIV */
#define IFX_SCU_EIFILT_FILTDIV_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_EIFILT_Bits.FILTDIV */
#define IFX_SCU_EIFILT_FILTDIV_OFF              (24)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_OFF                  (0)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_OFF                  (1)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_OFF                  (2)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_OFF                  (3)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_OFF                  (4)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_OFF                  (5)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_OFF                  (6)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_OFF                  (7)

/** \\brief  Length for Ifx_SCU_EISR_Bits.AE */
#define IFX_SCU_EISR_AE_LEN                     (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.AE */
#define IFX_SCU_EISR_AE_MSK                     (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.AE */
#define IFX_SCU_EISR_AE_OFF                     (0)

/** \\brief  Length for Ifx_SCU_EISR_Bits.DS */
#define IFX_SCU_EISR_DS_LEN                     (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.DS */
#define IFX_SCU_EISR_DS_MSK                     (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.DS */
#define IFX_SCU_EISR_DS_OFF                     (3)

