Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_EISR_Bits.IS0 */
#define IFX_SCU_EISR_IS0_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.IS0 */
#define IFX_SCU_EISR_IS0_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.IS0 */
#define IFX_SCU_EISR_IS0_OFF                    (2)

/** \\brief  Length for Ifx_SCU_EISR_Bits.IS1 */
#define IFX_SCU_EISR_IS1_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.IS1 */
#define IFX_SCU_EISR_IS1_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.IS1 */
#define IFX_SCU_EISR_IS1_OFF                    (5)

/** \\brief  Length for Ifx_SCU_EISR_Bits.OE */
#define IFX_SCU_EISR_OE_LEN                     (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.OE */
#define IFX_SCU_EISR_OE_MSK                     (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.OE */
#define IFX_SCU_EISR_OE_OFF                     (1)

/** \\brief  Length for Ifx_SCU_EISR_Bits.TIM */
#define IFX_SCU_EISR_TIM_LEN                    (16)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.TIM */
#define IFX_SCU_EISR_TIM_MSK                    (0xffff)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.TIM */
#define IFX_SCU_EISR_TIM_OFF                    (16)

/** \\brief  Length for Ifx_SCU_EISR_Bits.TO */
#define IFX_SCU_EISR_TO_LEN                     (1)

/** \\brief  Mask for Ifx_SCU_EISR_Bits.TO */
#define IFX_SCU_EISR_TO_MSK                     (0x1)

/** \\brief  Offset for Ifx_SCU_EISR_Bits.TO */
#define IFX_SCU_EISR_TO_OFF                     (4)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_OFF                   (16)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_LEN                  (2)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_MSK                  (0x3)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_OFF                  (24)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_OFF                   (2)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_OFF                   (1)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_OFF                    (0)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_OFF                   (3)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_OFF                  (17)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_OFF                 (26)

/** \\brief  Length for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_LEN                (2)

/** \\brief  Mask for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_MSK                (0x3)

/** \\brief  Offset for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_OFF                (7)

/** \\brief  Length for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_OFF                 (1)

/** \\brief  Length for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_OFF                 (0)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_LEN                 (8)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_MSK                 (0xff)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_OFF                 (24)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_OFF                  (0)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_OFF                  (16)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_OFF                 (17)

