Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_IGCR_Bits.IPEN14 */
#define IFX_SCU_IGCR_IPEN14_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_IGCR_Bits.IPEN14 */
#define IFX_SCU_IGCR_IPEN14_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_IGCR_Bits.IPEN14 */
#define IFX_SCU_IGCR_IPEN14_OFF                 (20)

/** \\brief  Length for Ifx_SCU_IGCR_Bits.IPEN15 */
#define IFX_SCU_IGCR_IPEN15_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_IGCR_Bits.IPEN15 */
#define IFX_SCU_IGCR_IPEN15_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_IGCR_Bits.IPEN15 */
#define IFX_SCU_IGCR_IPEN15_OFF                 (21)

/** \\brief  Length for Ifx_SCU_IGCR_Bits.IPEN16 */
#define IFX_SCU_IGCR_IPEN16_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_IGCR_Bits.IPEN16 */
#define IFX_SCU_IGCR_IPEN16_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_IGCR_Bits.IPEN16 */
#define IFX_SCU_IGCR_IPEN16_OFF                 (22)

/** \\brief  Length for Ifx_SCU_IGCR_Bits.IPEN17 */
#define IFX_SCU_IGCR_IPEN17_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_IGCR_Bits.IPEN17 */
#define IFX_SCU_IGCR_IPEN17_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_IGCR_Bits.IPEN17 */
#define IFX_SCU_IGCR_IPEN17_OFF                 (23)

/** \\brief  Length for Ifx_SCU_IN_Bits.P0 */
#define IFX_SCU_IN_P0_LEN                       (1)

/** \\brief  Mask for Ifx_SCU_IN_Bits.P0 */
#define IFX_SCU_IN_P0_MSK                       (0x1)

/** \\brief  Offset for Ifx_SCU_IN_Bits.P0 */
#define IFX_SCU_IN_P0_OFF                       (0)

/** \\brief  Length for Ifx_SCU_IN_Bits.P1 */
#define IFX_SCU_IN_P1_LEN                       (1)

/** \\brief  Mask for Ifx_SCU_IN_Bits.P1 */
#define IFX_SCU_IN_P1_MSK                       (0x1)

/** \\brief  Offset for Ifx_SCU_IN_Bits.P1 */
#define IFX_SCU_IN_P1_OFF                       (1)

/** \\brief  Length for Ifx_SCU_IOCR_Bits.PC0 */
#define IFX_SCU_IOCR_PC0_LEN                    (4)

/** \\brief  Mask for Ifx_SCU_IOCR_Bits.PC0 */
#define IFX_SCU_IOCR_PC0_MSK                    (0xf)

/** \\brief  Offset for Ifx_SCU_IOCR_Bits.PC0 */
#define IFX_SCU_IOCR_PC0_OFF                    (4)

/** \\brief  Length for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_LEN                    (4)

/** \\brief  Mask for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_MSK                    (0xf)

/** \\brief  Offset for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_OFF                    (12)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_LEN        (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_MSK        (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_OFF        (28)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_LEN         (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_OFF         (0)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_LEN         (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_OFF         (1)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_LEN         (18)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_MSK         (0x3ffff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_OFF         (2)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_LEN             (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_OFF             (27)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_LEN       (4)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_MSK       (0xf)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_OFF       (28)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_LEN             (19)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_MSK             (0x7ffff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_OFF             (0)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_LEN          (3)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_MSK          (0x7)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_OFF          (24)

/** \\brief  Length for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_LEN           (12)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_MSK           (0xfff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_OFF           (0)

/** \\brief  Length for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_LEN        (32)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_MSK        (0xffffffff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_OFF        (0)

/** \\brief  Length for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_OFF                 (16)

/** \\brief  Length for Ifx_SCU_LCLCON0_Bits.LS2 */
#define IFX_SCU_LCLCON0_LS2_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_LCLCON0_Bits.LS2 */
#define IFX_SCU_LCLCON0_LS2_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON0_Bits.LS2 */
#define IFX_SCU_LCLCON0_LS2_OFF                 (0)

/** \\brief  Length for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_MSK               (0x1)

