Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_OFF               (31)

/** \\brief  Length for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_OFF               (15)

/** \\brief  Length for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_OFF                 (16)

/** \\brief  Length for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_OFF                 (0)

/** \\brief  Length for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_OFF               (31)

/** \\brief  Length for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_OFF               (15)

/** \\brief  Length for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_OFF               (0)

/** \\brief  Length for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_OFF               (1)

/** \\brief  Length for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_OFF               (2)

/** \\brief  Length for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_LEN               (1)

/** \\brief  Mask for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_OFF               (3)

/** \\brief  Length for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_LEN                  (5)

/** \\brief  Mask for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_MSK                  (0x1f)

/** \\brief  Offset for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_OFF                  (0)

/** \\brief  Length for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_LEN                 (11)

/** \\brief  Mask for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_MSK                 (0x7ff)

/** \\brief  Offset for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_OFF                 (5)


/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.DELTA_RND_GAIN */
#define IFX_SCU_MODTRIMCON1_DELTA_RND_GAIN_LEN  (8)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.DELTA_RND_GAIN */
#define IFX_SCU_MODTRIMCON1_DELTA_RND_GAIN_MSK  (0xff)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.DELTA_RND_GAIN */
#define IFX_SCU_MODTRIMCON1_DELTA_RND_GAIN_OFF  (8)

/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.PEREMCDELAY */
#define IFX_SCU_MODTRIMCON1_PEREMCDELAY_LEN     (2)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.PEREMCDELAY */
#define IFX_SCU_MODTRIMCON1_PEREMCDELAY_MSK     (0x3)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.PEREMCDELAY */
#define IFX_SCU_MODTRIMCON1_PEREMCDELAY_OFF     (26)

/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.SYSEMCDELAY */
#define IFX_SCU_MODTRIMCON1_SYSEMCDELAY_LEN     (2)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.SYSEMCDELAY */
#define IFX_SCU_MODTRIMCON1_SYSEMCDELAY_MSK     (0x3)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.SYSEMCDELAY */
#define IFX_SCU_MODTRIMCON1_SYSEMCDELAY_OFF     (24)

/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.XCORR_AVG_SEL */
#define IFX_SCU_MODTRIMCON1_XCORR_AVG_SEL_LEN   (2)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.XCORR_AVG_SEL */
#define IFX_SCU_MODTRIMCON1_XCORR_AVG_SEL_MSK   (0x3)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.XCORR_AVG_SEL */
#define IFX_SCU_MODTRIMCON1_XCORR_AVG_SEL_OFF   (16)

/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.XCORR_SEL_DELAY */
#define IFX_SCU_MODTRIMCON1_XCORR_SEL_DELAY_LEN (2)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.XCORR_SEL_DELAY */
#define IFX_SCU_MODTRIMCON1_XCORR_SEL_DELAY_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.XCORR_SEL_DELAY */
#define IFX_SCU_MODTRIMCON1_XCORR_SEL_DELAY_OFF (18)

/** \\brief  Length for Ifx_SCU_MODTRIMCON1_Bits.XCORR_TOL */
#define IFX_SCU_MODTRIMCON1_XCORR_TOL_LEN       (8)

/** \\brief  Mask for Ifx_SCU_MODTRIMCON1_Bits.XCORR_TOL */
#define IFX_SCU_MODTRIMCON1_XCORR_TOL_MSK       (0xff)

/** \\brief  Offset for Ifx_SCU_MODTRIMCON1_Bits.XCORR_TOL */
#define IFX_SCU_MODTRIMCON1_XCORR_TOL_OFF       (0)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_OFF                    (16)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_OFF                    (17)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PS0 */
#define IFX_SCU_OMR_PS0_LEN                     (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PS0 */
#define IFX_SCU_OMR_PS0_MSK                     (0x1)

