Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR6 */
#define IFX_SCU_PDRR_PDR6_OFF                   (6)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_OFF                   (7)

/** \\brief  Length for Ifx_SCU_PERPLLCON0_Bits.DIVBY */
#define IFX_SCU_PERPLLCON0_DIVBY_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PERPLLCON0_Bits.DIVBY */
#define IFX_SCU_PERPLLCON0_DIVBY_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLCON0_Bits.DIVBY */
#define IFX_SCU_PERPLLCON0_DIVBY_OFF            (0)

/** \\brief  Length for Ifx_SCU_PERPLLCON0_Bits.NDIV */
#define IFX_SCU_PERPLLCON0_NDIV_LEN             (7)

/** \\brief  Mask for Ifx_SCU_PERPLLCON0_Bits.NDIV */
#define IFX_SCU_PERPLLCON0_NDIV_MSK             (0x7f)

/** \\brief  Offset for Ifx_SCU_PERPLLCON0_Bits.NDIV */
#define IFX_SCU_PERPLLCON0_NDIV_OFF             (9)

/** \\brief  Length for Ifx_SCU_PERPLLCON0_Bits.PDIV */
#define IFX_SCU_PERPLLCON0_PDIV_LEN             (3)

/** \\brief  Mask for Ifx_SCU_PERPLLCON0_Bits.PDIV */
#define IFX_SCU_PERPLLCON0_PDIV_MSK             (0x7)

/** \\brief  Offset for Ifx_SCU_PERPLLCON0_Bits.PDIV */
#define IFX_SCU_PERPLLCON0_PDIV_OFF             (24)

/** \\brief  Length for Ifx_SCU_PERPLLCON0_Bits.PLLPWD */
#define IFX_SCU_PERPLLCON0_PLLPWD_LEN           (1)

/** \\brief  Mask for Ifx_SCU_PERPLLCON0_Bits.PLLPWD */
#define IFX_SCU_PERPLLCON0_PLLPWD_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLCON0_Bits.PLLPWD */
#define IFX_SCU_PERPLLCON0_PLLPWD_OFF           (16)

/** \\brief  Length for Ifx_SCU_PERPLLCON0_Bits.RESLD */
#define IFX_SCU_PERPLLCON0_RESLD_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PERPLLCON0_Bits.RESLD */
#define IFX_SCU_PERPLLCON0_RESLD_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLCON0_Bits.RESLD */
#define IFX_SCU_PERPLLCON0_RESLD_OFF            (18)

/** \\brief  Length for Ifx_SCU_PERPLLCON1_Bits.K2DIV */
#define IFX_SCU_PERPLLCON1_K2DIV_LEN            (3)

/** \\brief  Mask for Ifx_SCU_PERPLLCON1_Bits.K2DIV */
#define IFX_SCU_PERPLLCON1_K2DIV_MSK            (0x7)

/** \\brief  Offset for Ifx_SCU_PERPLLCON1_Bits.K2DIV */
#define IFX_SCU_PERPLLCON1_K2DIV_OFF            (0)

/** \\brief  Length for Ifx_SCU_PERPLLCON1_Bits.K3DIV */
#define IFX_SCU_PERPLLCON1_K3DIV_LEN            (3)

/** \\brief  Mask for Ifx_SCU_PERPLLCON1_Bits.K3DIV */
#define IFX_SCU_PERPLLCON1_K3DIV_MSK            (0x7)

/** \\brief  Offset for Ifx_SCU_PERPLLCON1_Bits.K3DIV */
#define IFX_SCU_PERPLLCON1_K3DIV_OFF            (8)

/** \\brief  Length for Ifx_SCU_PERPLLSTAT_Bits.BY */
#define IFX_SCU_PERPLLSTAT_BY_LEN               (1)

/** \\brief  Mask for Ifx_SCU_PERPLLSTAT_Bits.BY */
#define IFX_SCU_PERPLLSTAT_BY_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLSTAT_Bits.BY */
#define IFX_SCU_PERPLLSTAT_BY_OFF               (6)

/** \\brief  Length for Ifx_SCU_PERPLLSTAT_Bits.K2RDY */
#define IFX_SCU_PERPLLSTAT_K2RDY_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PERPLLSTAT_Bits.K2RDY */
#define IFX_SCU_PERPLLSTAT_K2RDY_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLSTAT_Bits.K2RDY */
#define IFX_SCU_PERPLLSTAT_K2RDY_OFF            (5)

/** \\brief  Length for Ifx_SCU_PERPLLSTAT_Bits.K3RDY */
#define IFX_SCU_PERPLLSTAT_K3RDY_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PERPLLSTAT_Bits.K3RDY */
#define IFX_SCU_PERPLLSTAT_K3RDY_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLSTAT_Bits.K3RDY */
#define IFX_SCU_PERPLLSTAT_K3RDY_OFF            (4)

/** \\brief  Length for Ifx_SCU_PERPLLSTAT_Bits.LOCK */
#define IFX_SCU_PERPLLSTAT_LOCK_LEN             (1)

/** \\brief  Mask for Ifx_SCU_PERPLLSTAT_Bits.LOCK */
#define IFX_SCU_PERPLLSTAT_LOCK_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLSTAT_Bits.LOCK */
#define IFX_SCU_PERPLLSTAT_LOCK_OFF             (2)

/** \\brief  Length for Ifx_SCU_PERPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PERPLLSTAT_PWDSTAT_LEN          (1)

/** \\brief  Mask for Ifx_SCU_PERPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PERPLLSTAT_PWDSTAT_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_PERPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PERPLLSTAT_PWDSTAT_OFF          (1)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_LEN                  (3)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_MSK                  (0x7)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_OFF                  (8)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_LEN                (2)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_MSK                (0x3)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_OFF                (0)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_OFF                (0)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU0LS */
#define IFX_SCU_PMSTAT0_CPU0LS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU0LS */
#define IFX_SCU_PMSTAT0_CPU0LS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU0LS */
#define IFX_SCU_PMSTAT0_CPU0LS_OFF              (16)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_OFF                (1)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU1LS */
#define IFX_SCU_PMSTAT0_CPU1LS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU1LS */
#define IFX_SCU_PMSTAT0_CPU1LS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU1LS */
#define IFX_SCU_PMSTAT0_CPU1LS_OFF              (17)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU2 */
#define IFX_SCU_PMSTAT0_CPU2_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU2 */
#define IFX_SCU_PMSTAT0_CPU2_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU2 */
#define IFX_SCU_PMSTAT0_CPU2_OFF                (2)

