Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU2LS */
#define IFX_SCU_PMSTAT0_CPU2LS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU2LS */
#define IFX_SCU_PMSTAT0_CPU2LS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU2LS */
#define IFX_SCU_PMSTAT0_CPU2LS_OFF              (18)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU3 */
#define IFX_SCU_PMSTAT0_CPU3_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU3 */
#define IFX_SCU_PMSTAT0_CPU3_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU3 */
#define IFX_SCU_PMSTAT0_CPU3_OFF                (3)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU3LS */
#define IFX_SCU_PMSTAT0_CPU3LS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU3LS */
#define IFX_SCU_PMSTAT0_CPU3LS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU3LS */
#define IFX_SCU_PMSTAT0_CPU3LS_OFF              (19)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU4 */
#define IFX_SCU_PMSTAT0_CPU4_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU4 */
#define IFX_SCU_PMSTAT0_CPU4_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU4 */
#define IFX_SCU_PMSTAT0_CPU4_OFF                (4)

/** \\brief  Length for Ifx_SCU_PMSTAT0_Bits.CPU5 */
#define IFX_SCU_PMSTAT0_CPU5_LEN                (1)

/** \\brief  Mask for Ifx_SCU_PMSTAT0_Bits.CPU5 */
#define IFX_SCU_PMSTAT0_CPU5_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_PMSTAT0_Bits.CPU5 */
#define IFX_SCU_PMSTAT0_CPU5_OFF                (5)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_LEN           (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_MSK           (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_OFF           (8)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_LEN              (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_MSK              (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_OFF              (24)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_OFF              (12)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_LEN              (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_MSK              (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_OFF              (28)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_OFF            (27)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTCLR */
#define IFX_SCU_PMTRCSR0_LJTCLR_LEN             (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTCLR */
#define IFX_SCU_PMTRCSR0_LJTCLR_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTCLR */
#define IFX_SCU_PMTRCSR0_LJTCLR_OFF             (5)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTEN */
#define IFX_SCU_PMTRCSR0_LJTEN_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTEN */
#define IFX_SCU_PMTRCSR0_LJTEN_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTEN */
#define IFX_SCU_PMTRCSR0_LJTEN_OFF              (0)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTOVEN */
#define IFX_SCU_PMTRCSR0_LJTOVEN_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTOVEN */
#define IFX_SCU_PMTRCSR0_LJTOVEN_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTOVEN */
#define IFX_SCU_PMTRCSR0_LJTOVEN_OFF            (1)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTOVIEN */
#define IFX_SCU_PMTRCSR0_LJTOVIEN_LEN           (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTOVIEN */
#define IFX_SCU_PMTRCSR0_LJTOVIEN_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTOVIEN */
#define IFX_SCU_PMTRCSR0_LJTOVIEN_OFF           (2)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTSTP */
#define IFX_SCU_PMTRCSR0_LJTSTP_LEN             (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTSTP */
#define IFX_SCU_PMTRCSR0_LJTSTP_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTSTP */
#define IFX_SCU_PMTRCSR0_LJTSTP_OFF             (4)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LJTSTRT */
#define IFX_SCU_PMTRCSR0_LJTSTRT_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LJTSTRT */
#define IFX_SCU_PMTRCSR0_LJTSTRT_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LJTSTRT */
#define IFX_SCU_PMTRCSR0_LJTSTRT_OFF            (3)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.LPSLPEN */
#define IFX_SCU_PMTRCSR0_LPSLPEN_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.LPSLPEN */
#define IFX_SCU_PMTRCSR0_LPSLPEN_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.LPSLPEN */
#define IFX_SCU_PMTRCSR0_LPSLPEN_OFF            (29)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.SDSTEP */
#define IFX_SCU_PMTRCSR0_SDSTEP_LEN             (4)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.SDSTEP */
#define IFX_SCU_PMTRCSR0_SDSTEP_MSK             (0xf)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.SDSTEP */
#define IFX_SCU_PMTRCSR0_SDSTEP_OFF             (12)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTCLR */
#define IFX_SCU_PMTRCSR0_VDTCLR_LEN             (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTCLR */
#define IFX_SCU_PMTRCSR0_VDTCLR_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTCLR */
#define IFX_SCU_PMTRCSR0_VDTCLR_OFF             (21)

