Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTEN */
#define IFX_SCU_PMTRCSR0_VDTEN_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTEN */
#define IFX_SCU_PMTRCSR0_VDTEN_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTEN */
#define IFX_SCU_PMTRCSR0_VDTEN_OFF              (16)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTOVEN */
#define IFX_SCU_PMTRCSR0_VDTOVEN_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTOVEN */
#define IFX_SCU_PMTRCSR0_VDTOVEN_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTOVEN */
#define IFX_SCU_PMTRCSR0_VDTOVEN_OFF            (17)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTOVIEN */
#define IFX_SCU_PMTRCSR0_VDTOVIEN_LEN           (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTOVIEN */
#define IFX_SCU_PMTRCSR0_VDTOVIEN_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTOVIEN */
#define IFX_SCU_PMTRCSR0_VDTOVIEN_OFF           (18)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTSTP */
#define IFX_SCU_PMTRCSR0_VDTSTP_LEN             (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTSTP */
#define IFX_SCU_PMTRCSR0_VDTSTP_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTSTP */
#define IFX_SCU_PMTRCSR0_VDTSTP_OFF             (20)

/** \\brief  Length for Ifx_SCU_PMTRCSR0_Bits.VDTSTRT */
#define IFX_SCU_PMTRCSR0_VDTSTRT_LEN            (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR0_Bits.VDTSTRT */
#define IFX_SCU_PMTRCSR0_VDTSTRT_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR0_Bits.VDTSTRT */
#define IFX_SCU_PMTRCSR0_VDTSTRT_OFF            (19)

/** \\brief  Length for Ifx_SCU_PMTRCSR1_Bits.LJTCV */
#define IFX_SCU_PMTRCSR1_LJTCV_LEN              (16)

/** \\brief  Mask for Ifx_SCU_PMTRCSR1_Bits.LJTCV */
#define IFX_SCU_PMTRCSR1_LJTCV_MSK              (0xffff)

/** \\brief  Offset for Ifx_SCU_PMTRCSR1_Bits.LJTCV */
#define IFX_SCU_PMTRCSR1_LJTCV_OFF              (0)

/** \\brief  Length for Ifx_SCU_PMTRCSR1_Bits.VDTCV */
#define IFX_SCU_PMTRCSR1_VDTCV_LEN              (10)

/** \\brief  Mask for Ifx_SCU_PMTRCSR1_Bits.VDTCV */
#define IFX_SCU_PMTRCSR1_VDTCV_MSK              (0x3ff)

/** \\brief  Offset for Ifx_SCU_PMTRCSR1_Bits.VDTCV */
#define IFX_SCU_PMTRCSR1_VDTCV_OFF              (16)

/** \\brief  Length for Ifx_SCU_PMTRCSR2_Bits.LDJMPREQ */
#define IFX_SCU_PMTRCSR2_LDJMPREQ_LEN           (2)

/** \\brief  Mask for Ifx_SCU_PMTRCSR2_Bits.LDJMPREQ */
#define IFX_SCU_PMTRCSR2_LDJMPREQ_MSK           (0x3)

/** \\brief  Offset for Ifx_SCU_PMTRCSR2_Bits.LDJMPREQ */
#define IFX_SCU_PMTRCSR2_LDJMPREQ_OFF           (0)

/** \\brief  Length for Ifx_SCU_PMTRCSR2_Bits.LJTCNT */
#define IFX_SCU_PMTRCSR2_LJTCNT_LEN             (16)

/** \\brief  Mask for Ifx_SCU_PMTRCSR2_Bits.LJTCNT */
#define IFX_SCU_PMTRCSR2_LJTCNT_MSK             (0xffff)

/** \\brief  Offset for Ifx_SCU_PMTRCSR2_Bits.LJTCNT */
#define IFX_SCU_PMTRCSR2_LJTCNT_OFF             (16)

/** \\brief  Length for Ifx_SCU_PMTRCSR2_Bits.LJTOV */
#define IFX_SCU_PMTRCSR2_LJTOV_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR2_Bits.LJTOV */
#define IFX_SCU_PMTRCSR2_LJTOV_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR2_Bits.LJTOV */
#define IFX_SCU_PMTRCSR2_LJTOV_OFF              (8)

/** \\brief  Length for Ifx_SCU_PMTRCSR2_Bits.LJTOVCLR */
#define IFX_SCU_PMTRCSR2_LJTOVCLR_LEN           (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR2_Bits.LJTOVCLR */
#define IFX_SCU_PMTRCSR2_LJTOVCLR_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR2_Bits.LJTOVCLR */
#define IFX_SCU_PMTRCSR2_LJTOVCLR_OFF           (12)

/** \\brief  Length for Ifx_SCU_PMTRCSR2_Bits.LJTRUN */
#define IFX_SCU_PMTRCSR2_LJTRUN_LEN             (2)

/** \\brief  Mask for Ifx_SCU_PMTRCSR2_Bits.LJTRUN */
#define IFX_SCU_PMTRCSR2_LJTRUN_MSK             (0x3)

/** \\brief  Offset for Ifx_SCU_PMTRCSR2_Bits.LJTRUN */
#define IFX_SCU_PMTRCSR2_LJTRUN_OFF             (4)

/** \\brief  Length for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_LEN          (2)

/** \\brief  Mask for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_MSK          (0x3)

/** \\brief  Offset for Ifx_SCU_PMTRCSR3_Bits.VDROOPREQ */
#define IFX_SCU_PMTRCSR3_VDROOPREQ_OFF          (0)

/** \\brief  Length for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_LEN             (10)

/** \\brief  Mask for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_MSK             (0x3ff)

/** \\brief  Offset for Ifx_SCU_PMTRCSR3_Bits.VDTCNT */
#define IFX_SCU_PMTRCSR3_VDTCNT_OFF             (16)

/** \\brief  Length for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_LEN              (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR3_Bits.VDTOV */
#define IFX_SCU_PMTRCSR3_VDTOV_OFF              (8)

/** \\brief  Length for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_LEN           (1)

/** \\brief  Mask for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_PMTRCSR3_Bits.VDTOVCLR */
#define IFX_SCU_PMTRCSR3_VDTOVCLR_OFF           (12)

/** \\brief  Length for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_LEN             (2)

/** \\brief  Mask for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_MSK             (0x3)

/** \\brief  Offset for Ifx_SCU_PMTRCSR3_Bits.VDTRUN */
#define IFX_SCU_PMTRCSR3_VDTRUN_OFF             (4)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_OFF                (1)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_LEN                (6)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_MSK                (0x3f)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_OFF                (7)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_OFF                (6)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_OFF                (0)

