Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_LEN              (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_OFF              (15)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.TOUT20 */
#define IFX_SCU_RSTCON2_TOUT20_LEN              (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.TOUT20 */
#define IFX_SCU_RSTCON2_TOUT20_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.TOUT20 */
#define IFX_SCU_RSTCON2_TOUT20_OFF              (2)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.TOUT40 */
#define IFX_SCU_RSTCON2_TOUT40_LEN              (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.TOUT40 */
#define IFX_SCU_RSTCON2_TOUT40_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.TOUT40 */
#define IFX_SCU_RSTCON2_TOUT40_OFF              (3)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.TOUT60 */
#define IFX_SCU_RSTCON2_TOUT60_LEN              (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.TOUT60 */
#define IFX_SCU_RSTCON2_TOUT60_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.TOUT60 */
#define IFX_SCU_RSTCON2_TOUT60_OFF              (4)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.TOUT80 */
#define IFX_SCU_RSTCON2_TOUT80_LEN              (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.TOUT80 */
#define IFX_SCU_RSTCON2_TOUT80_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.TOUT80 */
#define IFX_SCU_RSTCON2_TOUT80_OFF              (5)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_LEN             (16)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_MSK             (0xffff)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_OFF             (16)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_OFF                 (0)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_OFF                 (2)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_LEN                  (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_MSK                  (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_OFF                  (6)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_OFF                 (10)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_OFF                 (12)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_OFF                 (14)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_OFF                 (16)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_OFF                 (18)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_LEN                 (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_MSK                 (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_OFF                 (20)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_LEN                   (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_MSK                   (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_OFF                   (8)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_OFF                 (18)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_OFF                 (19)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_OFF                 (20)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_OFF                (0)

