Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_OFF                (1)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_LEN               (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_OFF               (24)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.EVRC */
#define IFX_SCU_RSTSTAT_EVRC_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.EVRC */
#define IFX_SCU_RSTSTAT_EVRC_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.EVRC */
#define IFX_SCU_RSTSTAT_EVRC_OFF                (23)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_OFF                (27)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_OFF                (26)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_LEN               (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_OFF               (16)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.RBBF0 */
#define IFX_SCU_RSTSTAT_RBBF0_LEN               (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.RBBF0 */
#define IFX_SCU_RSTSTAT_RBBF0_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.RBBF0 */
#define IFX_SCU_RSTSTAT_RBBF0_OFF               (29)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.RBBF1 */
#define IFX_SCU_RSTSTAT_RBBF1_LEN               (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.RBBF1 */
#define IFX_SCU_RSTSTAT_RBBF1_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.RBBF1 */
#define IFX_SCU_RSTSTAT_RBBF1_OFF               (30)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_OFF                 (3)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_LEN               (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_OFF               (28)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_OFF                (5)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_OFF                (6)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_OFF                (7)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM3 */
#define IFX_SCU_RSTSTAT_STM3_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM3 */
#define IFX_SCU_RSTSTAT_STM3_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM3 */
#define IFX_SCU_RSTSTAT_STM3_OFF                (8)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM4 */
#define IFX_SCU_RSTSTAT_STM4_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM4 */
#define IFX_SCU_RSTSTAT_STM4_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM4 */
#define IFX_SCU_RSTSTAT_STM4_OFF                (9)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM5 */
#define IFX_SCU_RSTSTAT_STM5_LEN                (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM5 */
#define IFX_SCU_RSTSTAT_STM5_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM5 */
#define IFX_SCU_RSTSTAT_STM5_OFF                (10)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_OFF                  (4)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_OFF                 (25)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_OFF                 (22)

