Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_OFF                  (21)

/** \\brief  Length for Ifx_SCU_SEICON0_Bits.ENDINIT */
#define IFX_SCU_SEICON0_ENDINIT_LEN             (1)

/** \\brief  Mask for Ifx_SCU_SEICON0_Bits.ENDINIT */
#define IFX_SCU_SEICON0_ENDINIT_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_SEICON0_Bits.ENDINIT */
#define IFX_SCU_SEICON0_ENDINIT_OFF             (1)

/** \\brief  Length for Ifx_SCU_SEICON0_Bits.EPW */
#define IFX_SCU_SEICON0_EPW_LEN                 (14)

/** \\brief  Mask for Ifx_SCU_SEICON0_Bits.EPW */
#define IFX_SCU_SEICON0_EPW_MSK                 (0x3fff)

/** \\brief  Offset for Ifx_SCU_SEICON0_Bits.EPW */
#define IFX_SCU_SEICON0_EPW_OFF                 (2)

/** \\brief  Length for Ifx_SCU_SEICON0_Bits.REL */
#define IFX_SCU_SEICON0_REL_LEN                 (16)

/** \\brief  Mask for Ifx_SCU_SEICON0_Bits.REL */
#define IFX_SCU_SEICON0_REL_MSK                 (0xffff)

/** \\brief  Offset for Ifx_SCU_SEICON0_Bits.REL */
#define IFX_SCU_SEICON0_REL_OFF                 (16)

/** \\brief  Length for Ifx_SCU_SEICON0_Bits.Reserved */
#define IFX_SCU_SEICON0_RESERVED_LEN            (1)

/** \\brief  Mask for Ifx_SCU_SEICON0_Bits.Reserved */
#define IFX_SCU_SEICON0_RESERVED_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_SEICON0_Bits.Reserved */
#define IFX_SCU_SEICON0_RESERVED_OFF            (0)

/** \\brief  Length for Ifx_SCU_SEICON1_Bits.DR */
#define IFX_SCU_SEICON1_DR_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_SEICON1_Bits.DR */
#define IFX_SCU_SEICON1_DR_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_SEICON1_Bits.DR */
#define IFX_SCU_SEICON1_DR_OFF                  (3)

/** \\brief  Length for Ifx_SCU_SEICON1_Bits.IR0 */
#define IFX_SCU_SEICON1_IR0_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_SEICON1_Bits.IR0 */
#define IFX_SCU_SEICON1_IR0_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_SEICON1_Bits.IR0 */
#define IFX_SCU_SEICON1_IR0_OFF                 (2)

/** \\brief  Length for Ifx_SCU_SEICON1_Bits.IR1 */
#define IFX_SCU_SEICON1_IR1_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_SEICON1_Bits.IR1 */
#define IFX_SCU_SEICON1_IR1_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_SEICON1_Bits.IR1 */
#define IFX_SCU_SEICON1_IR1_OFF                 (5)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.AE */
#define IFX_SCU_SEISR_AE_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.AE */
#define IFX_SCU_SEISR_AE_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.AE */
#define IFX_SCU_SEISR_AE_OFF                    (0)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.DS */
#define IFX_SCU_SEISR_DS_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.DS */
#define IFX_SCU_SEISR_DS_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.DS */
#define IFX_SCU_SEISR_DS_OFF                    (3)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.IS0 */
#define IFX_SCU_SEISR_IS0_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.IS0 */
#define IFX_SCU_SEISR_IS0_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.IS0 */
#define IFX_SCU_SEISR_IS0_OFF                   (2)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.IS1 */
#define IFX_SCU_SEISR_IS1_LEN                   (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.IS1 */
#define IFX_SCU_SEISR_IS1_MSK                   (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.IS1 */
#define IFX_SCU_SEISR_IS1_OFF                   (5)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.OE */
#define IFX_SCU_SEISR_OE_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.OE */
#define IFX_SCU_SEISR_OE_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.OE */
#define IFX_SCU_SEISR_OE_OFF                    (1)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.TIM */
#define IFX_SCU_SEISR_TIM_LEN                   (16)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.TIM */
#define IFX_SCU_SEISR_TIM_MSK                   (0xffff)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.TIM */
#define IFX_SCU_SEISR_TIM_OFF                   (16)

/** \\brief  Length for Ifx_SCU_SEISR_Bits.TO */
#define IFX_SCU_SEISR_TO_LEN                    (1)

/** \\brief  Mask for Ifx_SCU_SEISR_Bits.TO */
#define IFX_SCU_SEISR_TO_MSK                    (0x1)

/** \\brief  Offset for Ifx_SCU_SEISR_Bits.TO */
#define IFX_SCU_SEISR_TO_OFF                    (4)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FARFUSE */
#define IFX_SCU_STSTAT_FARFUSE_LEN              (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FARFUSE */
#define IFX_SCU_STSTAT_FARFUSE_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FARFUSE */
#define IFX_SCU_STSTAT_FARFUSE_OFF              (18)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_LEN                (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_OFF                (16)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_LEN               (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_OFF               (22)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FTM */
#define IFX_SCU_STSTAT_FTM_LEN                  (7)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FTM */
#define IFX_SCU_STSTAT_FTM_MSK                  (0x7f)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FTM */
#define IFX_SCU_STSTAT_FTM_OFF                  (8)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_LEN                (8)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_MSK                (0xff)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_OFF                (0)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_LEN                (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_OFF                (17)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_LEN                 (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_MSK                 (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_OFF                 (15)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_LEN               (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_OFF               (21)

