Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_LEN               (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_OFF               (24)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_LEN                (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_OFF                (20)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_LEN             (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_OFF             (23)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.SUBFUSE */
#define IFX_SCU_STSTAT_SUBFUSE_LEN              (4)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.SUBFUSE */
#define IFX_SCU_STSTAT_SUBFUSE_MSK              (0xf)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.SUBFUSE */
#define IFX_SCU_STSTAT_SUBFUSE_OFF              (28)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_LEN                (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_OFF                (19)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_LEN             (1)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_OFF             (0)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_LEN              (8)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_MSK              (0xff)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_OFF              (8)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_LEN           (1)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_OFF           (1)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_LEN              (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_OFF              (0)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.DDC */
#define IFX_SCU_SYSCON_DDC_LEN                  (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.DDC */
#define IFX_SCU_SYSCON_DDC_MSK                  (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.DDC */
#define IFX_SCU_SYSCON_DDC_OFF                  (8)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_LEN              (2)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_MSK              (0x3)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_OFF              (2)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_LEN             (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_OFF             (4)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.INSEL */
#define IFX_SCU_SYSPLLCON0_INSEL_LEN            (2)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.INSEL */
#define IFX_SCU_SYSPLLCON0_INSEL_MSK            (0x3)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.INSEL */
#define IFX_SCU_SYSPLLCON0_INSEL_OFF            (30)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.MODEN */
#define IFX_SCU_SYSPLLCON0_MODEN_LEN            (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.MODEN */
#define IFX_SCU_SYSPLLCON0_MODEN_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.MODEN */
#define IFX_SCU_SYSPLLCON0_MODEN_OFF            (2)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.NDIV */
#define IFX_SCU_SYSPLLCON0_NDIV_LEN             (7)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.NDIV */
#define IFX_SCU_SYSPLLCON0_NDIV_MSK             (0x7f)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.NDIV */
#define IFX_SCU_SYSPLLCON0_NDIV_OFF             (9)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.PDIV */
#define IFX_SCU_SYSPLLCON0_PDIV_LEN             (3)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.PDIV */
#define IFX_SCU_SYSPLLCON0_PDIV_MSK             (0x7)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.PDIV */
#define IFX_SCU_SYSPLLCON0_PDIV_OFF             (24)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.PLLPWD */
#define IFX_SCU_SYSPLLCON0_PLLPWD_LEN           (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.PLLPWD */
#define IFX_SCU_SYSPLLCON0_PLLPWD_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.PLLPWD */
#define IFX_SCU_SYSPLLCON0_PLLPWD_OFF           (16)

/** \\brief  Length for Ifx_SCU_SYSPLLCON0_Bits.RESLD */
#define IFX_SCU_SYSPLLCON0_RESLD_LEN            (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON0_Bits.RESLD */
#define IFX_SCU_SYSPLLCON0_RESLD_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON0_Bits.RESLD */
#define IFX_SCU_SYSPLLCON0_RESLD_OFF            (18)

/** \\brief  Length for Ifx_SCU_SYSPLLCON1_Bits.K2DIV */
#define IFX_SCU_SYSPLLCON1_K2DIV_LEN            (3)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON1_Bits.K2DIV */
#define IFX_SCU_SYSPLLCON1_K2DIV_MSK            (0x7)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON1_Bits.K2DIV */
#define IFX_SCU_SYSPLLCON1_K2DIV_OFF            (0)

/** \\brief  Length for Ifx_SCU_SYSPLLCON2_Bits.MODCFG */
#define IFX_SCU_SYSPLLCON2_MODCFG_LEN           (16)

/** \\brief  Mask for Ifx_SCU_SYSPLLCON2_Bits.MODCFG */
#define IFX_SCU_SYSPLLCON2_MODCFG_MSK           (0xffff)

/** \\brief  Offset for Ifx_SCU_SYSPLLCON2_Bits.MODCFG */
#define IFX_SCU_SYSPLLCON2_MODCFG_OFF           (0)

/** \\brief  Length for Ifx_SCU_SYSPLLSTAT_Bits.BY */
#define IFX_SCU_SYSPLLSTAT_BY_LEN               (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLSTAT_Bits.BY */
#define IFX_SCU_SYSPLLSTAT_BY_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLSTAT_Bits.BY */
#define IFX_SCU_SYSPLLSTAT_BY_OFF               (6)

/** \\brief  Length for Ifx_SCU_SYSPLLSTAT_Bits.K2RDY */
#define IFX_SCU_SYSPLLSTAT_K2RDY_LEN            (1)

