Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_SYSPLLSTAT_Bits.K2RDY */
#define IFX_SCU_SYSPLLSTAT_K2RDY_MSK            (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLSTAT_Bits.K2RDY */
#define IFX_SCU_SYSPLLSTAT_K2RDY_OFF            (5)

/** \\brief  Length for Ifx_SCU_SYSPLLSTAT_Bits.LOCK */
#define IFX_SCU_SYSPLLSTAT_LOCK_LEN             (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLSTAT_Bits.LOCK */
#define IFX_SCU_SYSPLLSTAT_LOCK_MSK             (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLSTAT_Bits.LOCK */
#define IFX_SCU_SYSPLLSTAT_LOCK_OFF             (2)

/** \\brief  Length for Ifx_SCU_SYSPLLSTAT_Bits.MODRUN */
#define IFX_SCU_SYSPLLSTAT_MODRUN_LEN           (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLSTAT_Bits.MODRUN */
#define IFX_SCU_SYSPLLSTAT_MODRUN_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLSTAT_Bits.MODRUN */
#define IFX_SCU_SYSPLLSTAT_MODRUN_OFF           (7)

/** \\brief  Length for Ifx_SCU_SYSPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_SYSPLLSTAT_PWDSTAT_LEN          (1)

/** \\brief  Mask for Ifx_SCU_SYSPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_SYSPLLSTAT_PWDSTAT_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_SYSPLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_SYSPLLSTAT_PWDSTAT_OFF          (1)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_OFF               (0)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_OFF               (1)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_LEN                (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_OFF                (3)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.TRAP2 */
#define IFX_SCU_TRAPCLR_TRAP2_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.TRAP2 */
#define IFX_SCU_TRAPCLR_TRAP2_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.TRAP2 */
#define IFX_SCU_TRAPCLR_TRAP2_OFF               (2)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR0T */
#define IFX_SCU_TRAPDIS0_CPU0ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR0T */
#define IFX_SCU_TRAPDIS0_CPU0ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR0T */
#define IFX_SCU_TRAPDIS0_CPU0ESR0T_OFF          (0)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR1T */
#define IFX_SCU_TRAPDIS0_CPU0ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR1T */
#define IFX_SCU_TRAPDIS0_CPU0ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU0ESR1T */
#define IFX_SCU_TRAPDIS0_CPU0ESR1T_OFF          (1)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU0SMUT */
#define IFX_SCU_TRAPDIS0_CPU0SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU0SMUT */
#define IFX_SCU_TRAPDIS0_CPU0SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU0SMUT */
#define IFX_SCU_TRAPDIS0_CPU0SMUT_OFF           (3)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU0TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU0TRAP2T_LEN         (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU0TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU0TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU0TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU0TRAP2T_OFF         (2)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR0T */
#define IFX_SCU_TRAPDIS0_CPU1ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR0T */
#define IFX_SCU_TRAPDIS0_CPU1ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR0T */
#define IFX_SCU_TRAPDIS0_CPU1ESR0T_OFF          (8)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR1T */
#define IFX_SCU_TRAPDIS0_CPU1ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR1T */
#define IFX_SCU_TRAPDIS0_CPU1ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU1ESR1T */
#define IFX_SCU_TRAPDIS0_CPU1ESR1T_OFF          (9)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU1SMUT */
#define IFX_SCU_TRAPDIS0_CPU1SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU1SMUT */
#define IFX_SCU_TRAPDIS0_CPU1SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU1SMUT */
#define IFX_SCU_TRAPDIS0_CPU1SMUT_OFF           (11)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU1TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU1TRAP2T_LEN         (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU1TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU1TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU1TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU1TRAP2T_OFF         (10)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR0T */
#define IFX_SCU_TRAPDIS0_CPU2ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR0T */
#define IFX_SCU_TRAPDIS0_CPU2ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR0T */
#define IFX_SCU_TRAPDIS0_CPU2ESR0T_OFF          (16)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR1T */
#define IFX_SCU_TRAPDIS0_CPU2ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR1T */
#define IFX_SCU_TRAPDIS0_CPU2ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU2ESR1T */
#define IFX_SCU_TRAPDIS0_CPU2ESR1T_OFF          (17)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU2SMUT */
#define IFX_SCU_TRAPDIS0_CPU2SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU2SMUT */
#define IFX_SCU_TRAPDIS0_CPU2SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU2SMUT */
#define IFX_SCU_TRAPDIS0_CPU2SMUT_OFF           (19)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU2TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU2TRAP2T_LEN         (1)

