Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU2TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU2TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU2TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU2TRAP2T_OFF         (18)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR0T */
#define IFX_SCU_TRAPDIS0_CPU3ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR0T */
#define IFX_SCU_TRAPDIS0_CPU3ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR0T */
#define IFX_SCU_TRAPDIS0_CPU3ESR0T_OFF          (24)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR1T */
#define IFX_SCU_TRAPDIS0_CPU3ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR1T */
#define IFX_SCU_TRAPDIS0_CPU3ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU3ESR1T */
#define IFX_SCU_TRAPDIS0_CPU3ESR1T_OFF          (25)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU3SMUT */
#define IFX_SCU_TRAPDIS0_CPU3SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU3SMUT */
#define IFX_SCU_TRAPDIS0_CPU3SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU3SMUT */
#define IFX_SCU_TRAPDIS0_CPU3SMUT_OFF           (27)

/** \\brief  Length for Ifx_SCU_TRAPDIS0_Bits.CPU3TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU3TRAP2T_LEN         (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS0_Bits.CPU3TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU3TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS0_Bits.CPU3TRAP2T */
#define IFX_SCU_TRAPDIS0_CPU3TRAP2T_OFF         (26)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_OFF          (0)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_OFF          (1)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_OFF           (3)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_LEN         (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_OFF         (2)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_OFF          (8)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_LEN          (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_MSK          (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_OFF          (9)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_LEN           (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_MSK           (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_OFF           (11)

/** \\brief  Length for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_LEN         (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_MSK         (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_OFF         (10)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_OFF               (0)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_OFF               (1)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_LEN                (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_MSK                (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_OFF                (3)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_OFF               (2)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_LEN              (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_OFF              (0)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_LEN              (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_MSK              (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_OFF              (1)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_LEN               (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_MSK               (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_OFF               (3)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.TRAP2 */
#define IFX_SCU_TRAPSTAT_TRAP2_LEN              (1)

